; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=231, out_folder=./training, instance_id=37, seed=2061, goal_proportion=0.03

(define (problem blocksworld-37)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 - object)
 (:init 
    (arm-empty)
    (clear b136)
    (on b136 b162)
    (on-table b162)
    (clear b10)
    (on b10 b62)
    (on b62 b103)
    (on b103 b158)
    (on b158 b134)
    (on-table b134)
    (clear b227)
    (on b227 b230)
    (on b230 b215)
    (on b215 b143)
    (on b143 b71)
    (on b71 b221)
    (on b221 b61)
    (on b61 b107)
    (on b107 b115)
    (on-table b115)
    (clear b188)
    (on b188 b45)
    (on b45 b6)
    (on b6 b152)
    (on b152 b72)
    (on b72 b1)
    (on b1 b64)
    (on b64 b161)
    (on b161 b169)
    (on-table b169)
    (clear b181)
    (on b181 b85)
    (on b85 b36)
    (on b36 b66)
    (on b66 b22)
    (on-table b22)
    (clear b137)
    (on b137 b175)
    (on b175 b168)
    (on b168 b11)
    (on b11 b135)
    (on b135 b201)
    (on b201 b3)
    (on-table b3)
    (clear b8)
    (on b8 b116)
    (on b116 b178)
    (on b178 b119)
    (on b119 b131)
    (on b131 b141)
    (on b141 b216)
    (on-table b216)
    (clear b186)
    (on b186 b96)
    (on-table b96)
    (clear b48)
    (on b48 b80)
    (on b80 b128)
    (on b128 b129)
    (on-table b129)
    (clear b46)
    (on-table b46)
    (clear b109)
    (on b109 b173)
    (on-table b173)
    (clear b92)
    (on b92 b193)
    (on b193 b214)
    (on-table b214)
    (clear b104)
    (on b104 b73)
    (on b73 b194)
    (on b194 b89)
    (on b89 b205)
    (on b205 b113)
    (on b113 b15)
    (on b15 b182)
    (on b182 b196)
    (on b196 b213)
    (on-table b213)
    (clear b170)
    (on b170 b149)
    (on-table b149)
    (clear b185)
    (on b185 b114)
    (on b114 b23)
    (on-table b23)
    (clear b153)
    (on-table b153)
    (clear b69)
    (on b69 b53)
    (on b53 b55)
    (on-table b55)
    (clear b124)
    (on b124 b117)
    (on b117 b164)
    (on b164 b224)
    (on b224 b41)
    (on b41 b208)
    (on b208 b81)
    (on-table b81)
    (clear b142)
    (on b142 b165)
    (on b165 b94)
    (on b94 b17)
    (on-table b17)
    (clear b156)
    (on b156 b52)
    (on b52 b47)
    (on b47 b51)
    (on b51 b65)
    (on b65 b211)
    (on b211 b151)
    (on-table b151)
    (clear b44)
    (on-table b44)
    (clear b59)
    (on-table b59)
    (clear b190)
    (on b190 b100)
    (on b100 b127)
    (on b127 b25)
    (on-table b25)
    (clear b67)
    (on b67 b4)
    (on b4 b120)
    (on b120 b77)
    (on b77 b26)
    (on b26 b150)
    (on b150 b111)
    (on b111 b171)
    (on-table b171)
    (clear b184)
    (on b184 b110)
    (on b110 b7)
    (on b7 b187)
    (on b187 b40)
    (on b40 b118)
    (on b118 b200)
    (on b200 b166)
    (on b166 b76)
    (on b76 b34)
    (on b34 b68)
    (on b68 b174)
    (on b174 b91)
    (on b91 b172)
    (on b172 b226)
    (on-table b226)
    (clear b57)
    (on b57 b30)
    (on b30 b144)
    (on b144 b122)
    (on b122 b140)
    (on b140 b138)
    (on b138 b179)
    (on b179 b207)
    (on b207 b177)
    (on b177 b147)
    (on b147 b12)
    (on-table b12)
    (clear b49)
    (on-table b49)
    (clear b199)
    (on b199 b43)
    (on b43 b83)
    (on b83 b106)
    (on b106 b60)
    (on b60 b24)
    (on b24 b159)
    (on-table b159)
    (clear b28)
    (on b28 b139)
    (on b139 b155)
    (on b155 b14)
    (on b14 b176)
    (on b176 b204)
    (on b204 b145)
    (on-table b145)
    (clear b18)
    (on b18 b5)
    (on-table b5)
    (clear b217)
    (on b217 b108)
    (on b108 b35)
    (on b35 b218)
    (on-table b218)
    (clear b203)
    (on-table b203)
    (clear b133)
    (on b133 b183)
    (on b183 b95)
    (on b95 b75)
    (on-table b75)
    (clear b195)
    (on b195 b99)
    (on b99 b146)
    (on b146 b37)
    (on b37 b27)
    (on-table b27)
    (clear b219)
    (on b219 b228)
    (on-table b228)
    (clear b42)
    (on b42 b125)
    (on b125 b32)
    (on b32 b126)
    (on-table b126)
    (clear b97)
    (on-table b97)
    (clear b192)
    (on-table b192)
    (clear b222)
    (on-table b222)
    (clear b82)
    (on b82 b180)
    (on-table b180)
    (clear b154)
    (on b154 b102)
    (on b102 b38)
    (on b38 b90)
    (on b90 b21)
    (on b21 b206)
    (on b206 b148)
    (on b148 b212)
    (on b212 b33)
    (on b33 b13)
    (on b13 b220)
    (on-table b220)
    (clear b39)
    (on b39 b87)
    (on b87 b20)
    (on b20 b78)
    (on b78 b130)
    (on b130 b198)
    (on-table b198)
    (clear b98)
    (on b98 b167)
    (on b167 b9)
    (on b9 b86)
    (on b86 b132)
    (on b132 b223)
    (on b223 b229)
    (on b229 b202)
    (on b202 b88)
    (on b88 b50)
    (on-table b50)
    (clear b79)
    (on b79 b210)
    (on b210 b58)
    (on-table b58)
    (clear b231)
    (on b231 b112)
    (on b112 b16)
    (on b16 b2)
    (on b2 b197)
    (on-table b197)
    (clear b70)
    (on b70 b63)
    (on b63 b54)
    (on-table b54)
    (clear b101)
    (on b101 b225)
    (on b225 b56)
    (on b56 b123)
    (on b123 b31)
    (on-table b31)
    (clear b209)
    (on b209 b189)
    (on b189 b105)
    (on b105 b191)
    (on-table b191)
    (clear b157)
    (on b157 b160)
    (on b160 b19)
    (on-table b19)
    (clear b84)
    (on b84 b29)
    (on b29 b121)
    (on b121 b74)
    (on b74 b163)
    (on b163 b93)
    (on-table b93))
 (:goal  (and 
    (clear b3)
    (on b3 b6)
    (on-table b6)
    (clear b1)
    (on b1 b4)
    (on b4 b2)
    (on b2 b5)
    (on-table b5))))

; plan
1. (unstack b137 b175)
   deleted: (on b137 b175) (clear b137) (arm-empty)
   added: (holding b137) (clear b175)
   goals met: 1 of 8
2. (putdown b137)
   deleted: (holding b137)
   added: (clear b137) (arm-empty) (on-table b137)
   goals met: 1 of 8
3. (unstack b175 b168)
   deleted: (on b175 b168) (clear b175) (arm-empty)
   added: (holding b175) (clear b168)
   goals met: 1 of 8
4. (putdown b175)
   deleted: (holding b175)
   added: (clear b175) (arm-empty) (on-table b175)
   goals met: 1 of 8
5. (unstack b168 b11)
   deleted: (on b168 b11) (clear b168) (arm-empty)
   added: (holding b168) (clear b11)
   goals met: 1 of 8
6. (putdown b168)
   deleted: (holding b168)
   added: (clear b168) (arm-empty) (on-table b168)
   goals met: 1 of 8
7. (unstack b11 b135)
   deleted: (on b11 b135) (clear b11) (arm-empty)
   added: (holding b11) (clear b135)
   goals met: 1 of 8
8. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 1 of 8
9. (unstack b135 b201)
   deleted: (on b135 b201) (clear b135) (arm-empty)
   added: (holding b135) (clear b201)
   goals met: 1 of 8
10. (putdown b135)
   deleted: (holding b135)
   added: (clear b135) (arm-empty) (on-table b135)
   goals met: 1 of 8
11. (unstack b18 b5)
   deleted: (on b18 b5) (clear b18) (arm-empty)
   added: (holding b18) (clear b5)
   goals met: 1 of 8
12. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 1 of 8
13. (unstack b188 b45)
   deleted: (on b188 b45) (clear b188) (arm-empty)
   added: (holding b188) (clear b45)
   goals met: 1 of 8
14. (putdown b188)
   deleted: (holding b188)
   added: (clear b188) (arm-empty) (on-table b188)
   goals met: 1 of 8
15. (unstack b201 b3)
   deleted: (on b201 b3) (clear b201) (arm-empty)
   added: (holding b201) (clear b3)
   goals met: 2 of 8
16. (putdown b201)
   deleted: (holding b201)
   added: (clear b201) (arm-empty) (on-table b201)
   goals met: 2 of 8
17. (unstack b231 b112)
   deleted: (on b231 b112) (clear b231) (arm-empty)
   added: (holding b231) (clear b112)
   goals met: 2 of 8
18. (putdown b231)
   deleted: (holding b231)
   added: (clear b231) (arm-empty) (on-table b231)
   goals met: 2 of 8
19. (unstack b112 b16)
   deleted: (on b112 b16) (clear b112) (arm-empty)
   added: (holding b112) (clear b16)
   goals met: 2 of 8
20. (putdown b112)
   deleted: (holding b112)
   added: (clear b112) (arm-empty) (on-table b112)
   goals met: 2 of 8
21. (unstack b16 b2)
   deleted: (on b16 b2) (clear b16) (arm-empty)
   added: (holding b16) (clear b2)
   goals met: 2 of 8
22. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 2 of 8
23. (unstack b45 b6)
   deleted: (on b45 b6) (clear b45) (arm-empty)
   added: (holding b45) (clear b6)
   goals met: 2 of 8
24. (putdown b45)
   deleted: (holding b45)
   added: (clear b45) (arm-empty) (on-table b45)
   goals met: 2 of 8
25. (unstack b6 b152)
   deleted: (on b6 b152) (clear b6) (arm-empty)
   added: (holding b6) (clear b152)
   goals met: 2 of 8
26. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 3 of 8
27. (unstack b152 b72)
   deleted: (on b152 b72) (clear b152) (arm-empty)
   added: (holding b152) (clear b72)
   goals met: 3 of 8
28. (putdown b152)
   deleted: (holding b152)
   added: (clear b152) (arm-empty) (on-table b152)
   goals met: 3 of 8
29. (unstack b67 b4)
   deleted: (on b67 b4) (clear b67) (arm-empty)
   added: (holding b67) (clear b4)
   goals met: 3 of 8
30. (putdown b67)
   deleted: (holding b67)
   added: (clear b67) (arm-empty) (on-table b67)
   goals met: 3 of 8
31. (unstack b72 b1)
   deleted: (on b72 b1) (clear b72) (arm-empty)
   added: (holding b72) (clear b1)
   goals met: 4 of 8
32. (putdown b72)
   deleted: (holding b72)
   added: (clear b72) (arm-empty) (on-table b72)
   goals met: 4 of 8
33. (unstack b2 b197)
   deleted: (on b2 b197) (clear b2) (arm-empty)
   added: (holding b2) (clear b197)
   goals met: 4 of 8
34. (stack b2 b5)
   deleted: (clear b5) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b5)
   goals met: 5 of 8
35. (unstack b4 b120)
   deleted: (on b4 b120) (clear b4) (arm-empty)
   added: (holding b4) (clear b120)
   goals met: 5 of 8
36. (stack b4 b2)
   deleted: (clear b2) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b2)
   goals met: 6 of 8
37. (unstack b1 b64)
   deleted: (on b1 b64) (clear b1) (arm-empty)
   added: (holding b1) (clear b64)
   goals met: 5 of 8
38. (stack b1 b4)
   deleted: (clear b4) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b4)
   goals met: 7 of 8
39. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 6 of 8
40. (stack b3 b6)
   deleted: (clear b6) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b6)
   goals met: 8 of 8
